---
kind: type
id: T:Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder
source: html/13cd8e7c-acc8-af6e-0ae6-a9b77fcd913c.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder

This class is used to create Fields in the Extensible Storage framework.

## Syntax (C#)
```csharp
public class FieldBuilder : IDisposable
```